import { WireMark } from '@renderer/types'

const WIRE_RESISTANCE_OM_KM = {
  'А-16': 1.84,
  'А-25': 1.165,
  'А-35': 0.85,
  'А-50': 0.59,
  'А-70': 0.42,
  'А-95': 0.34,
  'А-120': 0.25,
  'А-150': 0.2,
  'АС-16': 2.77,
  'АС-25': 1.8,
  'АС-35': 1.76,
  'АС-50': 0.79,
  'АС-70': 0.43,
  'АС-95': 0.32,
  'АС-120': 0.25,
  'АС-150': 0.2,
  'КЛ-16': 1.91,
  'КЛ-25': 1.2,
  'КЛ-35': 0.87,
  'КЛ-50': 0.64,
  'КЛ-70': 0.44,
  'КЛ-95': 0.34,
  'КЛ-120': 0.25,
  'КЛ-150': 0.2,
  'КЛ-185': 0.16,
  'САСП-16': 1.91,
  'САСП-25': 1.2,
  'САСП-35': 0.868,
  'САСП-50': 0.641,
  'САСП-70': 0.443,
  'САСП-95': 0.32,
  'САСП-120': 0.253,
  'СИП-16': 1.91,
  'СИП-25': 1.2,
  'СИП-35': 0.868,
  'СИП-50': 0.641,
  'СИП-70': 0.443,
  'СИП-95': 0.32,
  'СИП-120': 0.253
} as const

export const WIRE_MARKS = Object.keys(WIRE_RESISTANCE_OM_KM) as Array<
  keyof typeof WIRE_RESISTANCE_OM_KM
>

export function getWireResistance_om_km(wire: WireMark) {
  return WIRE_RESISTANCE_OM_KM[wire] ?? null
}
